#include "AD9837.h"
#include "stm32100e_eval.h"
#include "usart.h"

/***************************************************************************/ /**
 * @brief 
 *
 * @param 
 *
 * @return 
*******************************************************************************/
void AD9837_Write(unsigned short val)
{
    unsigned char i;
    AD9837_SCK_HIGH(); //SCK = 1
    AD9837_CS_LOW();   //CS = 0

    for (i = 0; i < 16; i++)
    {
        if (val & 0x8000)
        {
            AD9837_MOSI_HIGH(); //MOSI = 1
            AD9837_SCK_LOW();   //SCK = 0
            AD9837_SCK_HIGH();  //SCK = 1
        }
        else
        {
            AD9837_MOSI_LOW(); //MOSI = 0
            AD9837_SCK_LOW();  //SCK = 0
            AD9837_SCK_HIGH(); //SCK = 1
        }
        val <<= 1;
    }
    AD9837_CS_HIGH(); //CS = 1
}

/***************************************************************************/ /**
 * @brief  1K正弦波输出. 1Hz--16.777
 *
 * @param 
 *
 * @return 
*******************************************************************************/
void AD9837_WaveSet_1KSIN(void)
{
    /*--0x2100(0010 0001 0000 0000)。控制寄存器。DB13置1.将一个字通过两次写入载入频率寄存器。第一次写入为14个LSB，第二次写入为14个MSB.
     DB8置1，将内部寄存器复位为0.*/
    AD9837_Write(0x2100);

    /*--0x4189（0100 0001 1000 1001）。频率寄存器0 LSB。DB15、DB14为0和1，表示寄存器0 LSB. */
    AD9837_Write(0x4189);
    /*--0x4001（0100 0000 0000 0001）。频率寄存器0 MSB。DB15、DB14为0和1，表示寄存器0 MSB. */
    AD9837_Write(0x4001);

    /*--0xC000（1100 0000 0000 0000）。相位寄存器0。DB15、DB14、DB13分别为1、1、0，DB12设置为无关(X),表示相位寄存器0 */
    AD9837_Write(0xC000);

    /*--0x2000（0010 0000 0000 0000）。退出复位 */
    AD9837_Write(0x2000);
}

/***************************************************************************/ /**
 * @brief  500HZ正弦波输出. 1Hz--16.777
 *
 * @param 
 *
 * @return 
*******************************************************************************/
void AD9837_WaveSet_500HZSIN(void)
{
    /*--0x2100(0010 0001 0000 0000)。控制寄存器。DB13置1.将一个字通过两次写入载入频率寄存器。第一次写入为14个LSB，第二次写入为14个MSB.
     DB8置1，将内部寄存器复位为0.*/
    AD9837_Write(0x2100);

    /*--0x60C4（0110 0000 1100 0100）。频率寄存器0 LSB。DB15、DB14为0和1，表示寄存器0 LSB. */
    AD9837_Write(0x60C4);
    /*--0x4001（0100 0000 0000 0000）。频率寄存器0 MSB。DB15、DB14为0和1，表示寄存器0 MSB. */
    AD9837_Write(0x4000);

    /*--0xC000（1100 0000 0000 0000）。相位寄存器0。DB15、DB14、DB13分别为1、1、0，DB12设置为无关(X),表示相位寄存器0 */
    AD9837_Write(0xC000);

    /*--0x2000（0010 0000 0000 0000）。退出复位 */
    AD9837_Write(0x2000);
}
